print(4 < 5 or 2 < 5)
print(5 > 2 or 3 > 5)
print(4 > 7 or 3 > 1)
print(5 > 2 or 3 < 5)
print(6 < 9 or 5 < 3)
print(7 > 2 or 5 > 2)
print(6 < 9 or 5 > 8)
print(2 > 5 or 6 > 3)
print(6 > 9 or 5 > 2)
print(5 < 7 or 8 < 9)
print(5 < 8 and 7 < 2)
print(5 > 7 and 4 < 7)
print(7 > 9 and 6 > 8)
print(8 < 9 and 8 > 9)
print(4 > 7 and 6 < 3)
print(7 < 5 and 3 < 4)
print(6 > 3 and 7 > 9)
print(6 < 7 and 8 < 7)
print(4 > 6 and 5 > 8)
print(6 < 8 and 5 > 7)

#sequence არის პითონის ობიექტის ტიპი რომელიც მომხმარებელს სშუალებას აძლევს რომ შეინახოს მონაცემები ერთმანეთის მიყოლებით

#selection არის როდესაც პაითონში გადაწყვეტილებები მიიღება if განაცხადით რომელიც ასევე ცნობილია როგორც შერჩევის განცხადება 

#iteration არის განცხადებების სიმრავლის განმეორებით შესრულება იტერაცია ეწოდება