# შემოატანინეთ მომხმარებელს თავისი ოჯახის წევრების სახელები და ასაკები
family_members = input("enter your family members: ")
print(family_members) 
# შემოატანინეთ მომხმარებელს თავისი საყვარელი პროგრამირების ენა

favorite_language = input("enter your favorite language: ")
print(favorite_language)


# შემოატანინეთ მომხმარებელს თავისი ასაკი,წონა,სიმაღლე და აურა და შეინახეთ ყველაფერი ცვლადებში შემდგომ კი შეამოწმეთ ამ ცვლადების type()💚

age = input("enter your age: ")
weight = input("enter your weight: ")
height = input("enter your height: ")
aura = input("enter your aura: ")
print(age + " " + weight + " " + height + " " + aura)
print(type(age))

# შემოატანინეთ მომხმარებელს თავისი ასაკი და შეინახეთ ცვლადში სახელად age შემდგომ კითხეთ მომხმარებელს თუ რამდენი ხნით სურს მომავალში მოგზაურობა და შეინახეთ ცვლადში სახელად future და ბოლოს დაპრინტეთ თუ რამდენი წლის იქნება მომავლში მოგზაურობის შემდეგ











